tests/performance/MatchingService/08-Matches-List-Load-Story3.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="JMT-MS-08 - Story 3 Matches Page Read Load" enabled="true">
      <stringProp name="TestPlan.comments">Story 3 (view potential matches), read-side load against MatchQueriesController - the endpoint pair Story 2's own plan 06 does not exercise, since plan 06 predates the real Matches page moving onto it. THREADS concurrent users, each authenticated as the same real user (AUTH_TOKEN), each mirroring the real page's own request shape: the four section panels (Waiting On You, Waiting On The Other Party, Confirmed, Rejected) fetch independently and in parallel, the profile page's Possible Matches tile fetches a one-row "active" count separately again, and the review screen fetches one match by id. None of these mutate anything, so the same account and the same match id are reused (recycled) across every thread and iteration.

Variables: HOST, PORT, THREADS and RAMP_SECONDS follow the same convention as every other plan in this repo (defaults: localhost, 5179, 20, 10). AUTH_TOKEN is the JWT from POST /api/auth/login for a user with at least one match in some section, so the section reads return real rows rather than only proving emptiness. MATCH_ID is a match this same user is a party to, for the details sampler.</stringProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments">
        <collectionProp name="Arguments.arguments">
          <elementProp name="HOST" elementType="Argument"><stringProp name="Argument.name">HOST</stringProp><stringProp name="Argument.value">${__P(HOST,localhost)}</stringProp></elementProp>
          <elementProp name="PORT" elementType="Argument"><stringProp name="Argument.name">PORT</stringProp><stringProp name="Argument.value">${__P(PORT,5179)}</stringProp></elementProp>
          <elementProp name="AUTH_TOKEN" elementType="Argument"><stringProp name="Argument.name">AUTH_TOKEN</stringProp><stringProp name="Argument.value">${__P(AUTH_TOKEN,SET_ME)}</stringProp></elementProp>
          <elementProp name="MATCH_ID" elementType="Argument"><stringProp name="Argument.name">MATCH_ID</stringProp><stringProp name="Argument.value">${__P(MATCH_ID,SET_ME)}</stringProp></elementProp>
          <elementProp name="THREADS" elementType="Argument"><stringProp name="Argument.name">THREADS</stringProp><stringProp name="Argument.value">${__P(THREADS,20)}</stringProp></elementProp>
          <elementProp name="RAMP_SECONDS" elementType="Argument"><stringProp name="Argument.name">RAMP_SECONDS</stringProp><stringProp name="Argument.value">${__P(RAMP_SECONDS,10)}</stringProp></elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Owner authentication" enabled="true">
        <stringProp name="TestPlan.comments">Sends the JWT as the auth_token cookie, the same way the browser does (MatchQueriesController sits behind the same JWT bearer handler as every other matches endpoint - ClaimRegistration.cs).</stringProp>
        <collectionProp name="HeaderManager.headers">
          <elementProp name="auth-cookie" elementType="Header"><stringProp name="Header.name">Cookie</stringProp><stringProp name="Header.value">auth_token=${AUTH_TOKEN}</stringProp></elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Concurrent Matches page viewers" enabled="true">
        <stringProp name="TestPlan.comments">THREADS users, one loop each, ramped up over RAMP_SECONDS. A failed sample stops that user only.</stringProp>
        <stringProp name="ThreadGroup.on_sample_error">STOPTHREAD</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController"><stringProp name="LoopController.loops">1</stringProp><boolProp name="LoopController.continue_forever">false</boolProp></elementProp>
        <stringProp name="ThreadGroup.num_threads">${THREADS}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${RAMP_SECONDS}</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Scenario 3 - Waiting On You section" enabled="true">
          <stringProp name="TestPlan.comments">GET /api/matches?section=waiting-on-you&amp;page=1&amp;size=10. One of the Matches page's four independently-loading section panels.</stringProp>
          <stringProp name="HTTPSampler.domain">${HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/matches</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="section" elementType="HTTPArgument"><stringProp name="Argument.name">section</stringProp><stringProp name="Argument.value">waiting-on-you</stringProp><boolProp name="HTTPArgument.always_encode">false</boolProp></elementProp>
              <elementProp name="page" elementType="HTTPArgument"><stringProp name="Argument.name">page</stringProp><stringProp name="Argument.value">1</stringProp><boolProp name="HTTPArgument.always_encode">false</boolProp></elementProp>
              <elementProp name="size" elementType="HTTPArgument"><stringProp name="Argument.name">size</stringProp><stringProp name="Argument.value">10</stringProp><boolProp name="HTTPArgument.always_encode">false</boolProp></elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Waiting On You returns 200" enabled="true">
            <collectionProp name="Asserion.test_strings"><stringProp name="1">200</stringProp></collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Scenario 3 - Waiting On The Other Party section" enabled="true">
          <stringProp name="TestPlan.comments">GET /api/matches?section=waiting-on-other&amp;page=1&amp;size=10.</stringProp>
          <stringProp name="HTTPSampler.domain">${HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/matches</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="section" elementType="HTTPArgument"><stringProp name="Argument.name">section</stringProp><stringProp name="Argument.value">waiting-on-other</stringProp><boolProp name="HTTPArgument.always_encode">false</boolProp></elementProp>
              <elementProp name="page" elementType="HTTPArgument"><stringProp name="Argument.name">page</stringProp><stringProp name="Argument.value">1</stringProp><boolProp name="HTTPArgument.always_encode">false</boolProp></elementProp>
              <elementProp name="size" elementType="HTTPArgument"><stringProp name="Argument.name">size</stringProp><stringProp name="Argument.value">10</stringProp><boolProp name="HTTPArgument.always_encode">false</boolProp></elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Waiting On The Other Party returns 200" enabled="true">
            <collectionProp name="Asserion.test_strings"><stringProp name="1">200</stringProp></collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Scenario 3 - Confirmed section" enabled="true">
          <stringProp name="TestPlan.comments">GET /api/matches?section=confirmed&amp;page=1&amp;size=10.</stringProp>
          <stringProp name="HTTPSampler.domain">${HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/matches</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="section" elementType="HTTPArgument"><stringProp name="Argument.name">section</stringProp><stringProp name="Argument.value">confirmed</stringProp><boolProp name="HTTPArgument.always_encode">false</boolProp></elementProp>
              <elementProp name="page" elementType="HTTPArgument"><stringProp name="Argument.name">page</stringProp><stringProp name="Argument.value">1</stringProp><boolProp name="HTTPArgument.always_encode">false</boolProp></elementProp>
              <elementProp name="size" elementType="HTTPArgument"><stringProp name="Argument.name">size</stringProp><stringProp name="Argument.value">10</stringProp><boolProp name="HTTPArgument.always_encode">false</boolProp></elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Confirmed returns 200" enabled="true">
            <collectionProp name="Asserion.test_strings"><stringProp name="1">200</stringProp></collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Scenario 3 - Rejected section" enabled="true">
          <stringProp name="TestPlan.comments">GET /api/matches?section=rejected&amp;page=1&amp;size=10. Collapsed by default in the UI, but still fetched eagerly by MatchSectionPanel on page load like the other three.</stringProp>
          <stringProp name="HTTPSampler.domain">${HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/matches</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="section" elementType="HTTPArgument"><stringProp name="Argument.name">section</stringProp><stringProp name="Argument.value">rejected</stringProp><boolProp name="HTTPArgument.always_encode">false</boolProp></elementProp>
              <elementProp name="page" elementType="HTTPArgument"><stringProp name="Argument.name">page</stringProp><stringProp name="Argument.value">1</stringProp><boolProp name="HTTPArgument.always_encode">false</boolProp></elementProp>
              <elementProp name="size" elementType="HTTPArgument"><stringProp name="Argument.name">size</stringProp><stringProp name="Argument.value">10</stringProp><boolProp name="HTTPArgument.always_encode">false</boolProp></elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Rejected returns 200" enabled="true">
            <collectionProp name="Asserion.test_strings"><stringProp name="1">200</stringProp></collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Profile tile - active count" enabled="true">
          <stringProp name="TestPlan.comments">GET /api/matches?section=active&amp;page=1&amp;size=1. The profile page's Possible Matches tile: a one-row fetch used only for its totalCount, requested on every profile page view.</stringProp>
          <stringProp name="HTTPSampler.domain">${HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/matches</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="section" elementType="HTTPArgument"><stringProp name="Argument.name">section</stringProp><stringProp name="Argument.value">active</stringProp><boolProp name="HTTPArgument.always_encode">false</boolProp></elementProp>
              <elementProp name="page" elementType="HTTPArgument"><stringProp name="Argument.name">page</stringProp><stringProp name="Argument.value">1</stringProp><boolProp name="HTTPArgument.always_encode">false</boolProp></elementProp>
              <elementProp name="size" elementType="HTTPArgument"><stringProp name="Argument.name">size</stringProp><stringProp name="Argument.value">1</stringProp><boolProp name="HTTPArgument.always_encode">false</boolProp></elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Active count returns 200" enabled="true">
            <collectionProp name="Asserion.test_strings"><stringProp name="1">200</stringProp></collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Scenario 4 - Get match details" enabled="true">
          <stringProp name="TestPlan.comments">GET /api/matches/{MATCH_ID}. The shared review screen's own read, opened from any row regardless of whether that row is currently actionable.</stringProp>
          <stringProp name="HTTPSampler.domain">${HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/matches/${MATCH_ID}</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Match details returns 200" enabled="true">
            <stringProp name="TestPlan.comments">A non-200 here usually means MATCH_ID is still SET_ME, or belongs to a different user than AUTH_TOKEN.</stringProp>
            <collectionProp name="Asserion.test_strings"><stringProp name="1">200</stringProp></collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>